<p style="text-align:center">
    <a href="https://skills.network/?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDS0321ENSkillsNetwork865-2023-01-01">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo"  />
    </a>
</p>

<h1 align=center><font size = 5>Assignment: SQL Notebook for Peer Assignment</font></h1>

Estimated time needed: **60** minutes.

## Introduction
Using this Python notebook you will:

1.  Understand the Spacex DataSet
2.  Load the dataset  into the corresponding table in a Db2 database
3.  Execute SQL queries to answer assignment questions

## Overview of the DataSet

SpaceX has gained worldwide attention for a series of historic milestones. 

It is the only private company ever to return a spacecraft from low-earth orbit, which it first accomplished in December 2010.
SpaceX advertises Falcon 9 rocket launches on its website with a cost of 62 million dollars wheras other providers cost upward of 165 million dollars each, much of the savings is because Space X can reuse the first stage. 


Therefore if we can determine if the first stage will land, we can determine the cost of a launch. 

This information can be used if an alternate company wants to bid against SpaceX for a rocket launch.

This dataset includes a record for each payload carried during a SpaceX mission into outer space.

In [3]:
!pip install sqlalchemy==1.3.9

Requirement already satisfied: sqlalchemy==1.3.9 in /home/jupyterlab/conda/envs/python/lib/python3.7/site-packages (1.3.9)

### Connect to the database

Let us first load the SQL extension and establish a connection with the database

In [4]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
import csv, sqlite3

con = sqlite3.connect("my_data1.db")
cur = con.cursor()

In [6]:
!pip install -q pandas==1.1.5

In [7]:
%sql sqlite:///my_data1.db

'Connected: @my_data1.db'

In [8]:
import pandas as pd
df = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-DS0321EN-SkillsNetwork/labs/module_2/data/Spacex.csv")
df.to_sql("SPACEXTBL", con, if_exists='replace', index=False,method="multi")

/home/jupyterlab/conda/envs/python/lib/python3.7/site-packages/pandas/core/generic.py:2882: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  both result in 0.1234 being formatted as 0.12.

## Tasks

Now write and execute SQL queries to solve the assignment tasks.

**Note: If the column names are in mixed case enclose it in double quotes
   For Example "Landing_Outcome"**

### Task 1




##### Display the names of the unique launch sites  in the space mission

In [9]:
%%sql
SELECT *
FROM SPACEXTBL LIMIT 20;

 * sqlite:///my_data1.db
Done.

[('06/04/2010', '18:45:00', 'F9 v1.0  B0003', 'CCAFS LC-40', 'Dragon Spacecraft Qualification Unit', 0.0, 'LEO', 'SpaceX', 'Success', 'Failure (parachute)'),
 ('12/08/2010', '15:43:00', 'F9 v1.0  B0004', 'CCAFS LC-40', 'Dragon demo flight C1, two CubeSats, barrel of Brouere cheese', 0.0, 'LEO (ISS)', 'NASA (COTS) NRO', 'Success', 'Failure (parachute)'),
 ('22/05/2012', '7:44:00', 'F9 v1.0  B0005', 'CCAFS LC-40', 'Dragon demo flight C2', 525.0, 'LEO (ISS)', 'NASA (COTS)', 'Success', 'No attempt'),
 ('10/08/2012', '0:35:00', 'F9 v1.0  B0006', 'CCAFS LC-40', 'SpaceX CRS-1', 500.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('03/01/2013', '15:10:00', 'F9 v1.0  B0007', 'CCAFS LC-40', 'SpaceX CRS-2', 677.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'No attempt'),
 ('29/09/2013', '16:00:00', 'F9 v1.1  B1003', 'VAFB SLC-4E', 'CASSIOPE', 500.0, 'Polar LEO', 'MDA', 'Success', 'Uncontrolled (ocean)'),
 ('12/03/2013', '22:41:00', 'F9 v1.1', 'CCAFS LC-40', 'SES-8', 3170.0, 'GTO', 'SES', 'Success', 'No attempt'),
 ('01/06/2014', '22:06:00', 'F9 v1.1', 'CCAFS LC-40', 'Thaicom 6', 3325.0, 'GTO', 'Thaicom', 'Success', 'No attempt'),
 ('18/04/2014', '19:25:00', 'F9 v1.1', 'CCAFS LC-40', 'SpaceX CRS-3', 2296.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'Controlled (ocean)'),
 ('14/07/2014', '15:15:00', 'F9 v1.1', 'CCAFS LC-40', 'OG2 Mission 1  6 Orbcomm-OG2 satellites', 1316.0, 'LEO', 'Orbcomm', 'Success', 'Controlled (ocean)'),
 ('08/05/2014', '8:00:00', 'F9 v1.1', 'CCAFS LC-40', 'AsiaSat 8', 4535.0, 'GTO', 'AsiaSat', 'Success', 'No attempt'),
 ('09/07/2014', '5:00:00', 'F9 v1.1 B1011', 'CCAFS LC-40', 'AsiaSat 6', 4428.0, 'GTO', 'AsiaSat', 'Success', 'No attempt'),
 ('21/09/2014', '5:52:00', 'F9 v1.1 B1010', 'CCAFS LC-40', 'SpaceX CRS-4', 2216.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'Uncontrolled (ocean)'),
 ('01/10/2015', '9:47:00', 'F9 v1.1 B1012', 'CCAFS LC-40', 'SpaceX CRS-5', 2395.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'Failure (drone ship)'),
 ('02/11/2015', '23:03:00', 'F9 v1.1 B1013', 'CCAFS LC-40', 'DSCOVR', 570.0, 'HEO', 'U.S. Air Force NASA NOAA', 'Success', 'Controlled (ocean)'),
 ('03/02/2015', '3:50:00', 'F9 v1.1 B1014', 'CCAFS LC-40', 'ABS-3A Eutelsat 115 West B', 4159.0, 'GTO', 'ABS Eutelsat', 'Success', 'No attempt'),
 ('14/04/2015', '20:10:00', 'F9 v1.1 B1015', 'CCAFS LC-40', 'SpaceX CRS-6', 1898.0, 'LEO (ISS)', 'NASA (CRS)', 'Success', 'Failure (drone ship)'),
 ('27/04/2015', '23:03:00', 'F9 v1.1 B1016', 'CCAFS LC-40', 'Turkmen 52 / MonacoSAT', 4707.0, 'GTO', 'Turkmenistan National Space Agency', 'Success', 'No attempt'),
 ('28/06/2015', '14:21:00', 'F9 v1.1 B1018', 'CCAFS LC-40', 'SpaceX CRS-7', 1952.0, 'LEO (ISS)', 'NASA (CRS)', 'Failure (in flight)', 'Precluded (drone ship)'),
 ('22/12/2015', '1:29:00', 'F9 FT B1019', 'CCAFS LC-40', 'OG2 Mission 2  11 Orbcomm-OG2 satellites', 2034.0, 'LEO', 'Orbcomm', 'Success', 'Success (ground pad)')]

In [10]:
%%sql
SELECT DISTINCT Launch_Site
FROM SPACEXTBL LIMIT 5;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',),
 ('VAFB SLC-4E',),
 ('KSC LC-39A',),
 ('CCAFS SLC-40',),
 (None,)]


### Task 2


#####  Display 5 records where launch sites begin with the string 'CCA'

In [11]:
%%sql
SELECT Launch_Site
FROM SPACEXTBL
WHERE Launch_Site LIKE '%CCA%' LIMIT 5;

 * sqlite:///my_data1.db
Done.

[('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',),
 ('CCAFS LC-40',)]

### Task 3




##### Display the total payload mass carried by boosters launched by NASA (CRS)

In [12]:
%%sql
SELECT SUM(PAYLOAD_MASS__KG_)
FROM SPACEXTBL
WHERE Customer = 'NASA (CRS)';

 * sqlite:///my_data1.db
Done.

[(45596.0,)]

### Task 4




##### Display average payload mass carried by booster version F9 v1.1

In [13]:
%%sql
SELECT AVG(PAYLOAD_MASS__KG_)
FROM SPACEXTBL
WHERE Booster_Version LIKE '%F9 v1.1%';

 * sqlite:///my_data1.db
Done.

[(2534.6666666666665,)]

### Task 5

##### List the date when the first succesful landing outcome in ground pad was acheived.


_Hint:Use min function_

In [14]:
%%sql
SELECT Date, Mission_Outcome, Landing_Outcome
FROM SPACEXTBL
WHERE Landing_Outcome LIKE '%Success (ground pad)%'
ORDER BY Date DESC;

 * sqlite:///my_data1.db
Done.

[('22/12/2015', 'Success', 'Success (ground pad)'),
 ('19/02/2017', 'Success', 'Success (ground pad)'),
 ('18/07/2016', 'Success', 'Success (ground pad)'),
 ('15/12/2017', 'Success', 'Success (ground pad)'),
 ('14/08/2017', 'Success', 'Success (ground pad)'),
 ('09/07/2017', 'Success', 'Success (ground pad)'),
 ('06/03/2017', 'Success', 'Success (ground pad)'),
 ('05/01/2017', 'Success', 'Success (ground pad)'),
 ('01/08/2018', 'Success (payload status unclear)', 'Success (ground pad)')]

### Task 6

##### List the names of the boosters which have success in drone ship and have payload mass greater than 4000 but less than 6000

In [15]:
%%sql
SELECT Booster_Version
FROM SPACEXTBL
WHERE Landing_Outcome = 'Success (drone ship)' AND PAYLOAD_MASS__KG_ > 4000 AND PAYLOAD_MASS__KG_ < 6000;

 * sqlite:///my_data1.db
Done.

[('F9 FT B1022',), ('F9 FT B1026',), ('F9 FT  B1021.2',), ('F9 FT  B1031.2',)]

### Task 7




##### List the total number of successful and failure mission outcomes

In [16]:
%%sql
SELECT COUNT(Mission_Outcome)
FROM SPACEXTBL
WHERE Mission_Outcome LIKE '%Success%';

 * sqlite:///my_data1.db
Done.

[(100,)]

In [17]:
%%sql
SELECT COUNT(Mission_Outcome)
FROM SPACEXTBL
WHERE Mission_Outcome LIKE '%Failure%';

 * sqlite:///my_data1.db
Done.

[(1,)]

In [18]:
%%sql
SELECT COUNT(Landing_Outcome)
FROM SPACEXTBL
WHERE Mission_Outcome LIKE '%Success%';

 * sqlite:///my_data1.db
Done.

[(100,)]

In [19]:
%%sql
SELECT COUNT(Landing_Outcome)
FROM SPACEXTBL
WHERE Mission_Outcome LIKE '%Failure%';

 * sqlite:///my_data1.db
Done.

[(1,)]

### Task 8



##### List the   names of the booster_versions which have carried the maximum payload mass. Use a subquery

In [20]:
%%sql
SELECT Booster_Version, PAYLOAD_MASS__KG_
FROM SPACEXTBL
WHERE PAYLOAD_MASS__KG_ = (SELECT MAX(PAYLOAD_MASS__KG_)
                           FROM SPACEXTBL);

 * sqlite:///my_data1.db
Done.

[('F9 B5 B1048.4', 15600.0),
 ('F9 B5 B1049.4', 15600.0),
 ('F9 B5 B1051.3', 15600.0),
 ('F9 B5 B1056.4', 15600.0),
 ('F9 B5 B1048.5', 15600.0),
 ('F9 B5 B1051.4', 15600.0),
 ('F9 B5 B1049.5', 15600.0),
 ('F9 B5 B1060.2 ', 15600.0),
 ('F9 B5 B1058.3 ', 15600.0),
 ('F9 B5 B1051.6', 15600.0),
 ('F9 B5 B1060.3', 15600.0),
 ('F9 B5 B1049.7 ', 15600.0)]

### Task 9


##### List the records which will display the month names, failure landing_outcomes in drone ship ,booster versions, launch_site for the months in year 2015.

**Note: SQLLite does not support monthnames. So you need to use  substr(Date, 4, 2) as month to get the months and substr(Date,7,4)='2015' for year.**

**Version 1: Months for the year 2015**

In [59]:
%%sql 
SELECT substr(Date, 4, 2) AS Month, substr(Date,7,4) AS Year, Mission_Outcome, Landing_Outcome, Booster_Version, Launch_Site 
FROM SPACEXTBL 
WHERE substr(Date,7,4)='2015'
ORDER BY substr(Date, 4, 2);

 * sqlite:///my_data1.db
Done.

[('02', '2015', 'Success', 'No attempt', 'F9 v1.1 B1014', 'CCAFS LC-40'),
 ('04', '2015', 'Success', 'Failure (drone ship)', 'F9 v1.1 B1015', 'CCAFS LC-40'),
 ('04', '2015', 'Success', 'No attempt', 'F9 v1.1 B1016', 'CCAFS LC-40'),
 ('06', '2015', 'Failure (in flight)', 'Precluded (drone ship)', 'F9 v1.1 B1018', 'CCAFS LC-40'),
 ('10', '2015', 'Success', 'Failure (drone ship)', 'F9 v1.1 B1012', 'CCAFS LC-40'),
 ('11', '2015', 'Success', 'Controlled (ocean)', 'F9 v1.1 B1013', 'CCAFS LC-40'),
 ('12', '2015', 'Success', 'Success (ground pad)', 'F9 FT B1019', 'CCAFS LC-40')]

**Version 2  landing outcome: failure (drone ship)**

In [29]:
%%sql
SELECT Date, Booster_Version, Launch_Site,Mission_Outcome, Landing_Outcome
FROM SPACEXTBL
WHERE Landing_Outcome LIKE '%Failure (drone ship)%'
AND Date LIKE '%2015%';

 * sqlite:///my_data1.db
Done.

[('01/10/2015', 'F9 v1.1 B1012', 'CCAFS LC-40', 'Success', 'Failure (drone ship)'),
 ('14/04/2015', 'F9 v1.1 B1015', 'CCAFS LC-40', 'Success', 'Failure (drone ship)')]

In [30]:
%%sql
SELECT Date, Booster_Version, Launch_Site, Mission_Outcome, Landing_Outcome
FROM SPACEXTBL
WHERE Date LIKE '%2015%';

 * sqlite:///my_data1.db
Done.

[('01/10/2015', 'F9 v1.1 B1012', 'CCAFS LC-40', 'Success', 'Failure (drone ship)'),
 ('02/11/2015', 'F9 v1.1 B1013', 'CCAFS LC-40', 'Success', 'Controlled (ocean)'),
 ('03/02/2015', 'F9 v1.1 B1014', 'CCAFS LC-40', 'Success', 'No attempt'),
 ('14/04/2015', 'F9 v1.1 B1015', 'CCAFS LC-40', 'Success', 'Failure (drone ship)'),
 ('27/04/2015', 'F9 v1.1 B1016', 'CCAFS LC-40', 'Success', 'No attempt'),
 ('28/06/2015', 'F9 v1.1 B1018', 'CCAFS LC-40', 'Failure (in flight)', 'Precluded (drone ship)'),
 ('22/12/2015', 'F9 FT B1019', 'CCAFS LC-40', 'Success', 'Success (ground pad)')]

### Task 10




##### Rank the count of landing outcomes (such as Failure (drone ship) or Success (ground pad)) between the date 2010-06-04 and 2017-03-20, in descending order.

**Version 1: Ranked by (1) year and (2) month** 
**PROBLEM: YEAR more than 2017!!**

In [93]:
%%sql
SELECT Date, Landing_Outcome
FROM SPACEXTBL
WHERE Date BETWEEN '04/06/2010' AND '20/03/2017'
ORDER BY substr(Date,7,4) 
AND substr(Date, 4, 2) DESC;

 * sqlite:///my_data1.db
Done.

[('06/04/2010', 'Failure (parachute)'),
 ('12/08/2010', 'Failure (parachute)'),
 ('10/08/2012', 'No attempt'),
 ('12/03/2013', 'No attempt'),
 ('18/04/2014', 'Controlled (ocean)'),
 ('14/07/2014', 'Controlled (ocean)'),
 ('08/05/2014', 'No attempt'),
 ('09/07/2014', 'No attempt'),
 ('14/04/2015', 'Failure (drone ship)'),
 ('17/01/2016', 'Failure (drone ship)'),
 ('04/08/2016', 'Success (drone ship)'),
 ('05/06/2016', 'Success (drone ship)'),
 ('15/06/2016', 'Failure (drone ship)'),
 ('18/07/2016', 'Success (ground pad)'),
 ('14/08/2016', 'Success (drone ship)'),
 ('14/01/2017', 'Success (drone ship)'),
 ('19/02/2017', 'Success (ground pad)'),
 ('16/03/2017', 'No attempt'),
 ('05/01/2017', 'Success (ground pad)'),
 ('15/05/2017', 'No attempt'),
 ('06/03/2017', 'Success (ground pad)'),
 ('07/05/2017', 'No attempt'),
 ('14/08/2017', 'Success (ground pad)'),
 ('09/07/2017', 'Success (ground pad)'),
 ('10/09/2017', 'Success (drone ship)'),
 ('10/11/2017', 'Success (drone ship)'),
 ('15/12/2017', 'Success (ground pad)'),
 ('18/04/2018', 'Success (drone ship)'),
 ('05/11/2018', 'Success (drone ship)'),
 ('06/04/2018', 'No attempt'),
 ('08/07/2018', 'Success'),
 ('09/10/2018', 'Success'),
 ('10/08/2018', 'Success'),
 ('15/11/2018', 'Success'),
 ('12/03/2018', 'Success'),
 ('12/05/2018', 'Failure'),
 ('05/04/2019', 'Success'),
 ('06/12/2019', 'Success'),
 ('08/06/2019', 'No attempt '),
 ('11/11/2019', 'Success'),
 ('12/05/2019', 'Success'),
 ('17/12/2019', 'Success'),
 ('19/01/2020', 'No attempt'),
 ('17/02/2020', 'Failure'),
 ('18/03/2020', 'Failure'),
 ('06/04/2020', 'Success'),
 ('13/06/2020', 'Success'),
 ('08/07/2020', 'Success'),
 ('18/08/2020', 'Success'),
 ('09/03/2020', 'Success'),
 ('10/06/2020', 'Success'),
 ('18/10/2020', 'Success'),
 ('11/05/2020', 'Success'),
 ('16/11/2020', 'Success'),
 ('12/06/2020', 'Success')]

**Version 2: count of types of outcomes grouped by year**

In [88]:
%%sql
SELECT substr(Date,7,4) AS Year, COUNT(*) Number_of_Outcomes, Mission_Outcome, Landing_Outcome
FROM SPACEXTBL
WHERE Landing_Outcome LIKE '%Failure%'
GROUP BY Year;

 * sqlite:///my_data1.db
Done.

[('2010', 2, 'Success', 'Failure (parachute)'),
 ('2015', 2, 'Success', 'Failure (drone ship)'),
 ('2016', 3, 'Success', 'Failure (drone ship)'),
 ('2018', 1, 'Success', 'Failure'),
 ('2020', 2, 'Success', 'Failure')]

In [87]:
%%sql
SELECT substr(Date,7,4) AS Year, COUNT(*) AS Number_of_Outcomes, Mission_Outcome, Landing_Outcome
FROM SPACEXTBL
WHERE Landing_Outcome LIKE '%Success%'
GROUP BY Year;

 * sqlite:///my_data1.db
Done.

[('2015', 1, 'Success', 'Success (ground pad)'),
 ('2016', 5, 'Success', 'Success (drone ship)'),
 ('2017', 14, 'Success', 'Success (drone ship)'),
 ('2018', 10, 'Success (payload status unclear)', 'Success (ground pad)'),
 ('2019', 10, 'Success', 'Success'),
 ('2020', 21, 'Success', 'Success')]

### Reference Links

* <a href ="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20String%20Patterns%20-%20Sorting%20-%20Grouping/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : String Patterns, Sorting and Grouping</a>  

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Built-in%20functions%20/Hands-on_Lab__Built-in_Functions.md.html?origin=www.coursera.org">Hands-on Lab: Built-in functions</a>

*  <a  href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Labs_Coursera_V5/labs/Lab%20-%20Sub-queries%20and%20Nested%20SELECTs%20/instructional-labs.md.html?origin=www.coursera.org">Hands-on Lab : Sub-queries and Nested SELECT Statements</a>

*   <a href="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-3-SQLmagic.ipynb">Hands-on Tutorial: Accessing Databases with SQL magic</a>

*  <a href= "https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/Module%205/DB0201EN-Week3-1-4-Analyzing.ipynb">Hands-on Lab: Analyzing a real World Data Set</a>

## Author(s)

<h4> Lakshmi Holla </h4>

## Other Contributors

<h4> Rav Ahuja </h4>

## Change log
| Date | Version | Changed by | Change Description |
|------|--------|--------|---------|
| 2021-07-09 | 0.2 |Lakshmi Holla | Changes made in magic sql|
| 2021-05-20 | 0.1 |Lakshmi Holla | Created Initial Version |

## <h3 align="center"> © IBM Corporation 2021. All rights reserved. <h3/>